'''
Найдите результат выражений для заданных значений 
a и b. Учитывайте регистр символов.

a = True
b = False
a and b or not a and not b
-------------------
x = 5
y = 10
y > x * x or y >= 2 * x and x < y
'''

'''
Отметьте выражения, значения которых равны True:
239" < "30" and 239 < 30
"239" < "30" and 239 > 30
"239" > "30" and 239 < 30
"239" > "30" and 239 > 30
'''

'''
Задание 1
Пользователь с клавиатуры вводит двухзначное число. Например, 26. Нужно 
показать на разных строках значение первого и второго разряда. 
В нашем случае этобудет выглядеть так:
2
6
'''

'''
Задание 2
Пользователь с клавиатурывводит трёхзначное число.
Например, 891. Нужно показать на разных строках значение первого, 
второго и третьего разряда. Также нужно
показать на отдельной строке сумму этих трёх чисел.

В нашем случае этобудет выглядеть так:
8
9
1
18
'''

'''
Задание 3
Пользователь вводит с клавиатуры две цифры. Необходимо создать число, 
содержащее эти цифры. Например,если с клавиатуры введено 9, 7, тогда 
нужно сформировать число 97.
'''

'''
Задание 4
Пользователь вводит с клавиатуры температуру по
шкале Цельсия. Требуется перевести температуру в градусы по Фаренгейту 
и вывести на экран.
'''

'''
В то далёкое время, когда Паша ходил в школу, ему очень не нравилась формула 
Герона для вычисления площади треугольника, так как казалась слишком сложной. 
В один прекрасный момент Павел решил избавить всех школьников от страданий и 
написать и распространить по школам программу, вычисляющую площадь 
треугольника по трём сторонам.
s=sqrt(p*(p-a)*(p-b)*(p-c))
где 
p-полупериметр треугольника. На вход программе подаются целые числа, 
выводом программы должно являться вещественное число, соответствующее 
площади треугольника.
'''

'''
Напишите программу, которая получает на вход три целых числа, по одному 
числу в строке, и выводит на консоль в три строки сначала максимальное, 
потом минимальное, после чего оставшееся число.

На ввод могут подаваться и повторяющиеся числа.
'''
# Больше задач на: https://education.yandex.ru/handbook/python