#for while
"""
Задание 1
Пользователь вводит с клавиатуры два числа. Нужно
показать все четные числа в указанном диапазоне.
"""

"""
Задание 2
Пользователь вводит с клавиатуры два числа. Нужно показать все числа в 
указанном диапазоне в порядке убывания.
"""

"""
Задание 2.9
Пользователь вводит с клавиатуры число. Требуется
посчитать факториал числа. Например, если введено 3,
факториал числа 1*2*3 = 6.
Формула для расчета факториала: n! = 1*2*3…*n,где
n — число для расчета факториала.
"""

"""
Задание 3
Пользователь вводит с клавиатуры длину и ширину
прямоугольника. Требуется отобразить на экран незаполненный прямоугольник 
(отображаются только границы прямоугольника). Размер длины и ширины 
равен введенным данным.
"""

"""
Задание 4
Пользователь вводит с клавиатуры длину и ширину
прямоугольника. Требуется отобразить на экран незаполненный прямоугольник 
(отображаются только границы прямоугольника). Размер длины и ширины равен
введенным данным.
"""

# try except https://education.yandex.ru/handbook/python/article/model-isklyuchenij-python-try-except-else-finally-moduli
"""
Задание 1
Пользователь вводит с клавиатуры целое шестизначное число. Написать 
программу, которая определяет, является ли введенное число — счастливым 
(Счастливым считается шестизначное число, у которого сумма первых 3 цифр 
равна сумме вторых трех цифр). 3+2+1.
С другой стороны 378423 несчастливое число, так как 3+7+8 != 4+2+3.
Если пользователь ввел не шестизначное число требуется вывести сообщение 
об ошибке.
"""

"""
Задание 2
Пользователь вводитшестизначное число.Необходимо вторую и пятую цифры.
Например, 723895 должно превратиться в 593827. Если пользователь ввел не 
шестизначное число требуется вывести сообщение об ошибке.
"""

"""
Задание 3
Пользователь вводит с клавиатуры номер месяца (от 1 до 12). 
В зависимости от полученного номера месяца программа выводит на экран 
надпись: Winter (если введенозначение 1,2 или 12), Spring (если введено 
значение от 3до 5), Summer (если введено значение от 6 до 8), Autumn
(если введено значение от 9 до 11). 
Если пользователь ввел значение не в диапазоне от 1 до 12 требуется 
вывести сообщение об ошибке.
"""

"""
Задание 1
Пользователь вводит с клавиатуры целое шестизначное число. Написать 
программу, которая определяет,является ли введенное число — счастливым 
(Счастливым считается шестизначное число, у которого сумма
первых 3 цифр равна сумме вторых трех цифр).
3+2+1.
С другой стороны 378423 несчастливое число, так
как 3+7+8 != 4+2+3.
Если пользователь ввел не шестизначное число требуется вывести сообщение 
об ошибке.
"""

"""
Задание 2
Пользователь вводитшестизначное число.Необходимо поменять в этом числе 
первую и шестую, вторую и пятую цифры.
Например, 723895 должно превратиться в 593827.
Если пользователь ввел не шестизначное число требуется вывести сообщение 
об ошибке.
"""

"""
Задание 3
Пользователь вводит с клавиатуры номер месяца (от 1 до 12). В зависимости 
от полученного номера месяца программа выводит на экран надпись: Winter 
(если введено значение 1,2 или 12), Spring (если введено значение от 3
до 5), Summer (если введено значение от 6 до 8), Autumn (если введено 
значение от 9 до 11). Если пользователь ввел значение не в диапазоне от 
1 до 12 требуется вывести сообщение об ошибке.
"""